{"gene": "EGFR", "type": "disease", "source": "uniprot", "text": "Lung cancer: A common malignancy affecting tissues of the lung. The most common form of lung cancer is non-small cell lung cancer (NSCLC) that can be divided into 3 major histologic subtypes: squamous cell carcinoma, adenocarcinoma, and large cell lung cancer. NSCLC is often diagnosed at an advanced stage and has a poor prognosis.. Neonatal nephrocutaneous inflammatory syndrome: An autosomal recessive disorder characterized by intrauterine growth retardation, premature birth, fragile skin, recurrent skin infections and sepsis, failure to thrive, nephrocalcinosis, and nephromegaly with tubular dysfunction. Some patients have chronic diarrhea, and necrotizing enterocolitis.."}
{"gene": "APP", "type": "disease", "source": "uniprot", "text": "Alzheimer disease 1: A form of Alzheimer disease, a neurodegenerative disorder characterized by progressive dementia, loss of cognitive abilities, and deposition of fibrillar amyloid proteins as intraneuronal neurofibrillary tangles, extracellular amyloid plaques and vascular amyloid deposits. The major constituents of these plaques are neurotoxic amyloid-beta protein 40 and amyloid-beta protein 42, that are produced by the proteolysis of the transmembrane APP protein. The cytotoxic C-terminal fragments (CTFs) and the caspase-cleaved products, such as C31, are also implicated in neuronal death. It can be associated with cerebral amyloid angiopathy. Alzheimer disease can be associated with cerebral amyloid angiopathy.. Cerebral amyloid angiopathy, APP-related: A hereditary localized amyloidosis due to amyloid-beta A4 peptide(s) deposition in the cerebral vessels. The principal clinical characteristics are recurrent cerebral and cerebellar hemorrhages, recurrent strokes, cerebral ischemia, cerebral infarction, and progressive mental deterioration. Patients develop cerebral hemorrhage because of the severe cerebral amyloid angiopathy. Parenchymal amyloid deposits are rare and largely in the form of pre-amyloid lesions or diffuse plaque-like structures. They are Congo red negative and lack the dense amyloid cores commonly present in Alzheimer disease. Some affected individuals manifest progressive aphasic dementia, leukoencephalopathy, and occipital calcifications.."}
{"gene": "BRCA1", "type": "disease", "source": "uniprot", "text": "Breast cancer: A common malignancy originating from breast epithelial tissue. Breast neoplasms can be distinguished by their histologic pattern. Invasive ductal carcinoma is by far the most common type. Breast cancer is etiologically and genetically heterogeneous. Important genetic factors have been indicated by familial occurrence and bilateral involvement. Mutations at more than one locus can be involved in different families or even in the same case.. Breast-ovarian cancer, familial, 1: A condition associated with familial predisposition to cancer of the breast and ovaries. Characteristic features in affected families are an early age of onset of breast cancer (often before age 50), increased chance of bilateral cancers (cancer that develop in both breasts, or both ovaries, independently), frequent occurrence of breast cancer among men, increased incidence of tumors of other specific organs, such as the prostate.. Ovarian cancer: The term ovarian cancer defines malignancies originating from ovarian tissue. Although many histologic types of ovarian tumors have been described, epithelial ovarian carcinoma is the most common form. Ovarian cancers are often asymptomatic and the recognized signs and symptoms, even of late-stage disease, are vague. Consequently, most patients are diagnosed with advanced disease.. Pancreatic cancer 4: A malignant neoplasm of the pancreas. Tumors"}
{"gene": "BRCA1", "type": "disease", "source": "uniprot", "text": "can arise from both the exocrine and endocrine portions of the pancreas, but 95% of them develop from the exocrine portion, including the ductal epithelium, acinar cells, connective tissue, and lymphatic tissue.. Fanconi anemia, complementation group S: A form of Fanconi anemia, a disorder affecting all bone marrow elements and resulting in anemia, leukopenia and thrombopenia. It is associated with cardiac, renal and limb malformations, dermal pigmentary changes, and a predisposition to the development of malignancies. At the cellular level it is associated with hypersensitivity to DNA-damaging agents, chromosomal instability (increased chromosome breakage) and defective DNA repair.."}
{"gene": "TP53", "type": "disease", "source": "uniprot", "text": "Esophageal cancer: A malignancy of the esophagus. The most common types are esophageal squamous cell carcinoma and adenocarcinoma. Cancer of the esophagus remains a devastating disease because it is usually not detected until it has progressed to an advanced incurable stage.. Li-Fraumeni syndrome: An autosomal dominant familial cancer syndrome that in its classic form is defined by the existence of a proband affected by a sarcoma before 45 years with a first degree relative affected by any tumor before 45 years and another first degree relative with any tumor before 45 years or a sarcoma at any age. Other clinical definitions for LFS have been proposed and called Li-Fraumeni like syndrome (LFL). In these families affected relatives develop a diverse set of malignancies at unusually early ages. Four types of cancers account for 80% of tumors occurring in TP53 germline mutation carriers: breast cancers, soft tissue and bone sarcomas, brain tumors (astrocytomas) and adrenocortical carcinomas. Less frequent tumors include choroid plexus carcinoma or papilloma before the age of 15, rhabdomyosarcoma before the age of 5, leukemia, Wilms tumor, malignant phyllodes tumor, colorectal and gastric cancers.. Squamous cell carcinoma of the head and neck: A non-melanoma skin cancer affecting the head"}
{"gene": "TP53", "type": "disease", "source": "uniprot", "text": "and neck. The hallmark of cutaneous SCC is malignant transformation of normal epidermal keratinocytes.. Lung cancer: A common malignancy affecting tissues of the lung. The most common form of lung cancer is non-small cell lung cancer (NSCLC) that can be divided into 3 major histologic subtypes: squamous cell carcinoma, adenocarcinoma, and large cell lung cancer. NSCLC is often diagnosed at an advanced stage and has a poor prognosis.. Papilloma of choroid plexus: A benign tumor of neuroectodermal origin that generally occurs in childhood, but has also been reported in adults. Although generally found within the ventricular system, choroid plexus papillomas can arise ectopically in the brain parenchyma or disseminate throughout the neuraxis. Patients present with signs and symptoms of increased intracranial pressure including headache, hydrocephalus, papilledema, nausea, vomiting, cranial nerve deficits, gait impairment, and seizures.. Adrenocortical carcinoma: A malignant neoplasm of the adrenal cortex and a rare childhood tumor. It occurs with increased frequency in patients with Beckwith-Wiedemann syndrome and Li-Fraumeni syndrome.. Basal cell carcinoma 7: A common malignant skin neoplasm that typically appears on hair-bearing skin, most commonly on sun-exposed areas. It is slow growing and rarely metastasizes, but has potentialities for local invasion and destruction. It usually develops"}
{"gene": "TP53", "type": "disease", "source": "uniprot", "text": "as a flat, firm, pale area that is small, raised, pink or red, translucent, shiny, and waxy, and the area may bleed following minor injury. Tumor size can vary from a few millimeters to several centimeters in diameter.. Bone marrow failure syndrome 5: A form of bone marrow failure syndrome, a heterogeneous group of life-threatening disorders characterized by hematopoietic defects in association with a range of variable extra-hematopoietic manifestations. BMFS5 is an autosomal dominant form characterized by infantile onset of severe red cell anemia requiring transfusion. Additional features include hypogammaglobulinemia, poor growth with microcephaly, developmental delay, and seizures.."}
